app/views/users/index.html.erb

          </li>
          <li><small><%= pluralize(user.articles.count, "article") if user.articles %></small></li>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]