app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is new article 1"], ["description", "This is new description 1"], ["created_at", "2015-11-13 14:16:10.846624"], ["updated_at", "2015-11-13 14:16:10.846624"]]