app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "tim4"], ["email", "tim4@example.com"], ["updated_at", "2015-12-02 17:29:28.356761"], ["id", 5]]